src/cf/InformationRegisters/РасходыНаККТУменьшающиеНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасходыНаККТУменьшающиеНалог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасходыУменьшающиеНалог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаписьКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУменьшенияНалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПООКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаводскойНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрационныйНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РасходыНаККТУменьшающиеНалог/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохраняет в данных справочника сумму расходов на ККТ, уменьшающих платеж по патенту.
//
// Параметры:
//  ЗаписьКалендаря               - СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности
//  ОбъектУменьшенияНалога        - СправочникСсылка.Патенты,СправочникСсылка.ВидыДеятельностиЕНВД - ссылка на патент
//      или вид деятельности, налоговый платеж по которому уменьшается.
//  СуммаРасходов  - Число(10, 0) - сумма уменьшающих налог расходов на приобретение ККТ.
//                                  Сумма расходов не должна превышать установленный лимит - см. УчетПСН.ПредельныйРазмерВычетаПоРасходамНаККТ()
//
Процедура ЗаписатьРасходыУменьшающиеНалог(ЗаписьКалендаря, ОбъектУменьшенияНалога = Неопределено, СуммаРасходов,
	КодПООКТМО = "", КодИФНС = "") Экспорт

	Если Не ЗначениеЗаполнено(ЗаписьКалендаря) Тогда
		Возврат;
	КонецЕсли;

	Если СуммаРасходов > ПредельныйРазмерВычетаПоРасходамНаККТ() Тогда
		Возврат;
	КонецЕсли;

	ЗаписьРасход = РегистрыСведений.РасходыНаККТУменьшающиеНалог.СоздатьМенеджерЗаписи();
	ЗаписьРасход.ЗаписьКалендаря = ЗаписьКалендаря;
	ЗаписьРасход.ОбъектУменьшенияНалога = ОбъектУменьшенияНалога;
	ЗаписьРасход.КодПООКТМО = СокрЛП(КодПООКТМО);
	ЗаписьРасход.КодИФНС = СокрЛП(КодИФНС);
	ЗаписьРасход.РасходыУменьшающиеНалог = СуммаРасходов;

	ЗаписьРасход.Записать();
КонецПроцедуры

Процедура ПолучитьСуммуРасходовУменьшающиеНалог(ЗаписьКалендаря, ОбъектУменьшенияНалога = Неопределено, СуммаРасходов,
	КодПООКТМО = "", КодИФНС = "") Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	Сумма(РасходыНаККТУменьшающиеНалог.РасходыУменьшающиеНалог) КАК РасходыУменьшающиеНалог
						  |ИЗ
						  |	РегистрСведений.РасходыНаККТУменьшающиеНалог КАК РасходыНаККТУменьшающиеНалог
						  |ГДЕ
						  |	РасходыНаККТУменьшающиеНалог.ЗаписьКалендаря = &ЗаписьКалендаря");

	Запрос.УстановитьПараметр("ЗаписьКалендаря", ЗаписьКалендаря);
	Если ЗначениеЗаполнено(ОбъектУменьшенияНалога) Тогда
		Запрос.Текст = Запрос.Текст + " И РасходыНаККТУменьшающиеНалог.ОбъектУменьшенияНалога = &ОбъектУменьшенияНалога";
		Запрос.УстановитьПараметр("ОбъектУменьшенияНалога", ОбъектУменьшенияНалога);
	КонецЕсли;
	Если Не ПустаяСтрока(КодПООКТМО) Тогда
		Запрос.Текст = Запрос.Текст + " И РасходыНаККТУменьшающиеНалог.КодПООКТМО = &КодПООКТМО";
		Запрос.УстановитьПараметр("КодПООКТМО", СокрЛП(КодПООКТМО));
	КонецЕсли;
	Если Не ПустаяСтрока(КодПООКТМО) Тогда
		Запрос.Текст = Запрос.Текст + " И РасходыНаККТУменьшающиеНалог.КодИФНС = &КодИФНС";
		Запрос.УстановитьПараметр("КодИФНС", СокрЛП(КодИФНС));
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.РасходыУменьшающиеНалог) Тогда
		СуммаРасходов = Выборка.РасходыУменьшающиеНалог;
	Иначе
		СуммаРасходов = 0;
	КонецЕсли;

КонецПроцедуры

Функция ПредельныйРазмерВычетаПоРасходамНаККТ() Экспорт
	
	// Пункт 1.1 статьи 346.51 НК РФ.
	Возврат 18000;
	
КонецФункции

#КонецОбласти

#КонецЕсли
